Revit 2027 API
BuiltInFailures.SketchFailures.NoLoopsError Property
 Sketch is empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoLoopsError { get; }
Public Shared ReadOnly Property NoLoopsError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoLoopsError {
	FailureDefinitionId^ get ();
}
static member NoLoopsError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace